res/cf/Enums/ТипыНастроекКВА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНастроекКВА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Примитивная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ссылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хранилище</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

res/cf/Catalogs/НастройкиХранилищеКВА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиХранилищеКВА</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНастройки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНастроекКВА</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНастройкиХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНастройкиСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеНастройкиПримитив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МассивЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеУниверсальное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>32</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/CommonModules/НастройкиКВАПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает сохраненные ранее параметры
// Параметры:
//  ИдентификаторНастройки - Строка - Имя предопределенного или идентификатор
//
// Возвращаемое значение:
//   ЛюбойТип - Параметры по указанному имени, которые были ранее сохранены
//
Функция ПолучитьНастройки(ИдентификаторНастройки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос();
	Попытка
		РезультатСсылка = ПредопределенноеЗначение("Справочник.НастройкиХранилищеКВА." + ИдентификаторНастройки);
		Запрос.Текст = "ВЫБРАТЬ
		               |	НастройкиХранилищеКВА.ТипНастройки КАК ТипНастройки,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиПримитив КАК ЗначениеПримитив,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиСсылка КАК ЗначениеСсылка,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиХранилище КАК ЗначениеХранилище
		               |ИЗ
		               |	Справочник.НастройкиХранилищеКВА КАК НастройкиХранилищеКВА
		               |ГДЕ
		               |	НастройкиХранилищеКВА.Ссылка = &РезультатСсылка";
		Запрос.УстановитьПараметр("РезультатСсылка", РезультатСсылка);
	Исключение
		Запрос.Текст = "ВЫБРАТЬ
		               |	НастройкиХранилищеКВА.ТипНастройки КАК ТипНастройки,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиПримитив КАК ЗначениеПримитив,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиСсылка КАК ЗначениеСсылка,
		               |	НастройкиХранилищеКВА.ЗначениеНастройкиХранилище КАК ЗначениеХранилище,
		               |	НастройкиХранилищеКВА.МассивЗначений.(
		               |		ЗначениеУниверсальное КАК ЗначениеУниверсальное
		               |	) КАК МассивЗначений
		               |ИЗ
		               |	Справочник.НастройкиХранилищеКВА КАК НастройкиХранилищеКВА
		               |ГДЕ
		               |	НастройкиХранилищеКВА.ИдентификаторНастройки = &ИдентификаторНастройки
		               |	И НЕ НастройкиХранилищеКВА.ПометкаУдаления";
		Запрос.УстановитьПараметр("ИдентификаторНастройки", ИдентификаторНастройки);
	КонецПопытки;

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Количество() > 1 Тогда
			ТекстОшибки = "Ошибка получения данных настройки, множественная запись! Идентификатор: " + ИдентификаторНастройки;
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		Если Выборка.Следующий() Тогда
			Если Выборка.ТипНастройки = Перечисления.ТипыНастроекКВА.Примитивная Тогда
				Возврат Выборка.ЗначениеПримитив;
			ИначеЕсли Выборка.ТипНастройки = Перечисления.ТипыНастроекКВА.Ссылка Тогда
				Возврат Выборка.ЗначениеСсылка;
			ИначеЕсли Выборка.ТипНастройки = Перечисления.ТипыНастроекКВА.Массив Тогда
				Возврат Выборка.МассивЗначений.Выгрузить().ВыгрузитьКолонку("ЗначениеУниверсальное");
			Иначе
				Возврат Выборка.ЗначениеХранилище.Получить();
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
